# *Задача 20: * В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность. 
# В случае с английским алфавитом очки распределяются так:
# A, E, I, O, U, L, N, S, T, R – 1 очко; 
# D, G – 2 очка; 
# B, C, M, P – 3 очка; 
# F, H, V, W, Y – 4 очка; 
# K – 5 очков; 
# J, X – 8 очков; 
# Q, Z – 10 очков. 
# А русские буквы оцениваются так: 
# А, В, Е, И, Н, О, Р, С, Т – 1 очко; 
# Д, К, Л, М, П, У – 2 очка; 
# Б, Г, Ё, Ь, Я – 3 очка; 
# Й, Ы – 4 очка; 
# Ж, З, Х, Ц, Ч – 5 очков; 
# Ш, Э, Ю – 8 очков; 
# Ф, Щ, Ъ – 10 очков. 
# Напишите программу, которая вычисляет стоимость введенного пользователем слова. 
# Будем считать, что на вход подается только одно слово, 
# которое содержит либо только английские, либо только русские буквы.
# *Пример:*
# ноутбук
#     12

enter_word = input("Введите слово: ")
word_upper = enter_word.upper()
value_word = 0
for letter in word_upper:
    dic_ru = {
         'А, В, Е, И, Н, О, Р, С, Т, A, E, I, O, U, L, N, S, T, R' : 1, 
         'Д, К, Л, М, П, У, D, G' : 2, 
         'Б, Г, Ё, Ь, Я, B, C, M, P' : 3, 
         'Й, Ы, F, H, V, W, Y' : 4, 
         'Ж, З, Х, Ц, Ч, K' : 5, 
         'Ш, Э, Ю, J, X': 8, 
         'Ф, Щ, Ъ, Q, Z': 10
        }
    for key in dic_ru.keys():
            a = key
            key_list = key.split(", ")
            for el in key_list:
                if el == letter:
                    value_word = value_word + dic_ru.get(a)
print(f"Ценность слова '{enter_word}' => {value_word}")
        

    
